docs: replace Mermaid diagram with plaintext
Workaround this issue that affects GitHub as of 2024-09-08:
https://github.com/mermaid-js/mermaid/issues/5820
